Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: كأن لم يغنوا فيها ألا إن ثمود كفروا ربهم ألا بعدا لثمود
en: As if they had never prospered therein. Unquestionably, Thamud denied their Lord; then, away with Thamud.

source: ولقد جاءت رسلنا إبراهيم بالبشرى قالوا سلاما قال سلام فما لبث أن جاء بعجل حنيذ
en: And certainly did Our messengers come to Abraham with good tidings; they said, "Peace." He said, "Peace," and did not delay in bringing [them] a roasted calf.

source: فلما رأى أيديهم لا تصل إليه نكرهم وأوجس منهم خيفة قالوا لا تخف إنا أرسلنا إلى قوم لوط
en: But when he saw their hands not reaching for it, he distrusted them and felt from them apprehension. They said, "Fear not. We have been sent to the people of Lot."

source: وامرأته قائمة فضحكت فبشرناها بإسحاق ومن وراء إسحاق يعقوب
en: And his Wife was standing, and she smiled. Then We gave her good tidings of Isaac and after Isaac, Jacob.

source: قالت يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب
en: She said, "Woe to me! Shall I give birth while I am an old woman and this, my husband, is an old man? Indeed, this is an amazing thing!"

source: قالوا أتعجبين من أمر الله رحمت الله وبركاته عليكم أهل البيت إنه حميد مجيد
en: They said, "Are you amazed at the decree of Allah? May the mercy of Allah and His blessings be upon you, people of the house. Indeed, He is Praiseworthy and Honorable."

source: فلما ذهب عن إبراهيم الروع وجاءته البشرى يجادلنا في قوم لوط
en: And when the fright had left Abraham and the good tidings had reached him, he began to argue with Us concerning the people of Lot.

source: إن إبراهيم لحليم أواه منيب
en: Indeed, Abraham was forbearing, grieving and [frequently] returning [to Allah].

source: يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود
en: [The angels said], "O Abraham, give up this [plea]. Indeed, the command of your Lord has come, and indeed, there will reach them a punishment that cannot be repelled."

source: ولما جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقال هذا يوم عصيب
en: And when Our messengers, [the angels], came to Lot, he was anguished for them and felt for them great discomfort and said, "This is a trying day."

source: وجاءه قومه يهرعون إليه ومن قبل كانوا يعملون السيئات قال يا قوم هؤلاء بناتي هن أطهر لكم فاتقوا الله ولا تخزون في ضيفي أليس منكم رجل رشيد
en: And his people came hastening to him, and before [this] they had been doing evil deeds. He said, "O my people, these are my daughters; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not among you a man of reason?"

source: قالوا لقد علمت ما لنا في بناتك من حق وإنك لتعلم ما نريد
en: They said, "You have already known that we have not concerning your daughters any claim, and indeed, you know what we want."

source: قال لو أن لي بكم قوة أو آوي إلى ركن شديد
en: He said, "If only I had against you some power or could take refuge in a strong support."

source: قالوا يا لوط إنا رسل ربك لن يصلوا إليك فأسر بأهلك بقطع من الليل ولا يلتفت منكم أحد إلا امرأتك إنه مصيبها ما أصابهم إن موعدهم الصبح أليس الصبح بقريب
en: The angels said, "O Lot, indeed we are messengers of your Lord; [therefore], they will never reach you. So set out with your family during a portion of the night and let not any among you look back - except your wife; indeed, she will be struck by that which strikes them. Indeed, their appointment is [for] the morning. Is not the morning near?"

source: فلما جاء أمرنا جعلنا عاليها سافلها وأمطرنا عليها حجارة من سجيل منضود
en: So when Our command came, We made the highest part [of the city] its lowest and rained upon them stones of layered hard clay, [which were]

source: مسومة عند ربك وما هي من الظالمين ببعيد
en: Marked from your Lord. And Allah 's punishment is not from the wrongdoers [very] far.

source: وإلى مدين أخاهم شعيبا قال يا قوم اعبدوا الله ما لكم من إله غيره ولا تنقصوا المكيال والميزان إني أراكم بخير وإني أخاف عليكم عذاب يوم محيط
en: And to Madyan [We sent] their brother Shu'ayb. He said, "O my people, worship Allah; you have no deity other than Him. And do not decrease from the measure and the scale. Indeed, I see you in prosperity, but indeed, I fear for you the punishment of an all-encompassing Day.

source: ويا قوم أوفوا المكيال والميزان بالقسط ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: And O my people, give full measure and weight in justice and do not deprive the people of their due and do not commit abuse on the earth, spreading corruption.

source: بقيت الله خير لكم إن كنتم مؤمنين وما أنا عليكم بحفيظ
en: What remains [lawful] from Allah is best for you, if you would be believers. But I am not a guardian over you."

source: قالوا يا شعيب أصلاتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء إنك لأنت الحليم الرشيد
en: They said, "O Shu'ayb, does your prayer command you that we should leave what our fathers worship or not do with our wealth what we please? Indeed, you are the forbearing, the discerning!"

source: قال يا قوم أرأيتم إن كنت على بينة من ربي ورزقني منه رزقا حسنا وما أريد أن أخالفكم إلى ما أنهاكم عنه إن أريد إلا الإصلاح ما استطعت وما توفيقي إلا بالله عليه توكلت وإليه أنيب
en: He said, "O my people, have you considered: if I am upon clear evidence from my Lord and He has provided me with a good provision from Him...? And I do not intend to differ from you in that which I have forbidden you; I only intend reform as much as I am able. And my success is not but through Allah. Upon him I have relied, and to Him I return.

source: ويا قوم لا يجرمنكم شقاقي أن يصيبكم مثل ما أصاب قوم نوح أو قوم هود أو قوم صالح وما قوم لوط منكم ببعيد
en: And O my people, let not [your] dissension from me cause you to be struck by that similar to what struck the people of Noah or the people of Hud or the people of Salih. And the people of Lot are not from you far away.

source: واستغفروا ربكم ثم توبوا إليه إن ربي رحيم ودود
en: And ask forgiveness of your Lord and then repent to Him. Indeed, my Lord is Merciful and Affectionate."

source: قالوا يا شعيب ما نفقه كثيرا مما تقول وإنا لنراك فينا ضعيفا ولولا رهطك لرجمناك وما أنت علينا بعزيز
en: They said, "O Shu'ayb, we do not understand much of what you say, and indeed, we consider you among us as weak. And if not for your family, we would have stoned you [to death]; and you are not to us one respected."

source: قال يا قوم أرهطي أعز عليكم من الله واتخذتموه وراءكم ظهريا إن ربي بما تعملون محيط
en: He said, "O my people, is my family more respected for power by you than Allah? But you put Him behind your backs [in neglect]. Indeed, my Lord is encompassing of what you do.

source: ويا قوم اعملوا على مكانتكم إني عامل سوف تعلمون من يأتيه عذاب يخزيه ومن هو كاذب وارتقبوا إني معكم رقيب
en: And O my people, work according to your position; indeed, I am working. You are going to know to whom will come a punishment that will disgrace him and who is a liar. So watch; indeed, I am with you a watcher, [awaiting the outcome]."

source: ولما جاء أمرنا نجينا شعيبا والذين آمنوا معه برحمة منا وأخذت الذين ظلموا الصيحة فأصبحوا في ديارهم جاثمين
en: And when Our command came, We saved Shu'ayb and those who believed with him, by mercy from Us. And the shriek seized those who had wronged, and they became within their homes [corpses] fallen prone

source: كأن لم يغنوا فيها ألا بعدا لمدين كما بعدت ثمود
en: As if they had never prospered therein. Then, away with Madyan as Thamud was taken away.

source: ولقد أرسلنا موسى بآياتنا وسلطان مبين
en: And We did certainly send Moses with Our signs and a clear authority

source: إلى فرعون وملئه فاتبعوا أمر فرعون وما أمر فرعون برشيد
en: To Pharaoh and his establishment, but they followed the command of Pharaoh, and the command of Pharaoh was not [at all] discerning.

source: يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود
en: He will precede his people on the Day of Resurrection and lead them into the Fire; and wretched is the place to which they are led.

source: وأتبعوا في هذه لعنة ويوم القيامة بئس الرفد المرفود
en: And they were followed in this [world] with a curse and on the Day of Resurrection. And wretched is the gift which is given.

source: ذلك من أنباء القرى نقصه عليك منها قائم وحصيد
en: That is from the news of the cities, which We relate to you; of them, some are [still] standing and some are [as] a harvest [mowed down].

source: وما ظلمناهم ولكن ظلموا أنفسهم فما أغنت عنهم آلهتهم التي يدعون من دون الله من شيء لما جاء أمر ربك وما زادوهم غير تتبيب
en: And We did not wrong them, but they wronged themselves. And they were not availed at all by their gods which they invoked other than Allah when there came the command of your Lord. And they did not increase them in other than ruin.

source: وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد
en: And thus is the seizure of your Lord when He seizes the cities while they are committing wrong. Indeed, His seizure is painful and severe.

source: إن في ذلك لآية لمن خاف عذاب الآخرة ذلك يوم مجموع له الناس وذلك يوم مشهود
en: Indeed in that is a sign for those who fear the punishment of the Hereafter. That is a Day for which the people will be collected, and that is a Day [which will be] witnessed.

source: وما نؤخره إلا لأجل معدود
en: And We do not delay it except for a limited term.

source: يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد
en: The Day it comes no soul will speak except by His permission. And among them will be the wretched and the prosperous.

source: فأما الذين شقوا ففي النار لهم فيها زفير وشهيق
en: As for those who were [destined to be] wretched, they will be in the Fire. For them therein is [violent] exhaling and inhaling.

source: خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك إن ربك فعال لما يريد
en: [They will be] abiding therein as long as the heavens and the earth endure, except what your Lord should will. Indeed, your Lord is an effecter of what He intends.

source: وأما الذين سعدوا ففي الجنة خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك عطاء غير مجذوذ
en: And as for those who were [destined to be] prosperous, they will be in Paradise, abiding therein as long as the heavens and the earth endure, except what your Lord should will - a bestowal uninterrupted.

source: فلا تك في مرية مما يعبد هؤلاء ما يعبدون إلا كما يعبد آباؤهم من قبل وإنا لموفوهم نصيبهم غير منقوص
en: So do not be in doubt, [O Muhammad], as to what these [polytheists] are worshipping. They worship not except as their fathers worshipped before. And indeed, We will give them their share undiminished.

source: ولقد آتينا موسى الكتاب فاختلف فيه ولولا كلمة سبقت من ربك لقضي بينهم وإنهم لفي شك منه مريب
en: And We had certainly given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been judged between them. And indeed they are, concerning the Qur'an, in disquieting doubt.

source: وإن كلا لما ليوفينهم ربك أعمالهم إنه بما يعملون خبير
en: And indeed, each [of the believers and disbelievers] - your Lord will fully compensate them for their deeds. Indeed, He is Acquainted with what they do.

source: فاستقم كما أمرت ومن تاب معك ولا تطغوا إنه بما تعملون بصير
en: So remain on a right course as you have been commanded, [you] and those who have turned back with you [to Allah], and do not transgress. Indeed, He is Seeing of what you do.

source: ولا تركنوا إلى الذين ظلموا فتمسكم النار وما لكم من دون الله من أولياء ثم لا تنصرون
en: And do not incline toward those who do wrong, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped.

source: وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين
en: And establish prayer at the two ends of the day and at the approach of the night. Indeed, good deeds do away with misdeeds. That is a reminder for those who remember.

source: واصبر فإن الله لا يضيع أجر المحسنين
en: And be patient, for indeed, Allah does not allow to be lost the reward of those who do good.

source: فلولا كان من القرون من قبلكم أولو بقية ينهون عن الفساد في الأرض إلا قليلا ممن أنجينا منهم واتبع الذين ظلموا ما أترفوا فيه وكانوا مجرمين
en: So why were there not among the generations before you those of enduring discrimination forbidding corruption on earth - except a few of those We saved from among them? But those who wronged pursued what luxury they were given therein, and they were criminals.

source: وما كان ربك ليهلك القرى بظلم وأهلها مصلحون
en: And your Lord would not have destroyed the cities unjustly while their people were reformers.

source: ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين
en: And if your Lord had willed, He could have made mankind one community; but they will not cease to differ.

source: إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين
en: Except whom your Lord has given mercy, and for that He created them. But the word of your Lord is to be fulfilled that, "I will surely fill Hell with jinn and men all together."

source: وكلا نقص عليك من أنباء الرسل ما نثبت به فؤادك وجاءك في هذه الحق وموعظة وذكرى للمؤمنين
en: And each [story] We relate to you from the news of the messengers is that by which We make firm your heart. And there has come to you, in this, the truth and an instruction and a reminder for the believers.

source: وقل للذين لا يؤمنون اعملوا على مكانتكم إنا عاملون
en: And say to those who do not believe, "Work according to your position; indeed, we are working.

source: وانتظروا إنا منتظرون
en: And wait, indeed, we are waiting."

source: ولله غيب السماوات والأرض وإليه يرجع الأمر كله فاعبده وتوكل عليه وما ربك بغافل عما تعملون
en: And to Allah belong the unseen [aspects] of the heavens and the earth and to Him will be returned the matter, all of it, so worship Him and rely upon Him. And your Lord is not unaware of that which you do.

source: الر تلك آيات الكتاب المبين
en: Alif, Lam, Ra. These are the verses of the clear Book.

source: إنا أنزلناه قرآنا عربيا لعلكم تعقلون
en: Indeed, We have sent it down as an Arabic Qur'an that you might understand.

source: نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين
en: We relate to you, [O Muhammad], the best of stories in what We have revealed to you of this Qur'an although you were, before it, among the unaware.

source: إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين
en: [Of these stories mention] when Joseph said to his father, "O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me."

source: قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين
en: He said, "O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.

source: وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم
en: And thus will your Lord choose you and teach you the interpretation of narratives and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise."

source: لقد كان في يوسف وإخوته آيات للسائلين
en: Certainly were there in Joseph and his brothers signs for those who ask,

source: إذ قالوا ليوسف وأخوه أحب إلى أبينا منا ونحن عصبة إن أبانا لفي ضلال مبين
en: When they said, "Joseph and his brother are more beloved to our father than we, while we are a clan. Indeed, our father is in clear error.

source: اقتلوا يوسف أو اطرحوه أرضا يخل لكم وجه أبيكم وتكونوا من بعده قوما صالحين
en: Kill Joseph or cast him out to [another] land; the countenance of your father will [then] be only for you, and you will be after that a righteous people."

source: قال قائل منهم لا تقتلوا يوسف وألقوه في غيابت الجب يلتقطه بعض السيارة إن كنتم فاعلين
en: Said a speaker among them, "Do not kill Joseph but throw him into the bottom of the well; some travelers will pick him up - if you would do [something]."

source: قالوا يا أبانا ما لك لا تأمنا على يوسف وإنا له لناصحون
en: They said, "O our father, why do you not entrust us with Joseph while indeed, we are to him sincere counselors?

source: أرسله معنا غدا يرتع ويلعب وإنا له لحافظون
en: Send him with us tomorrow that he may eat well and play. And indeed, we will be his guardians.

source: قال إني ليحزنني أن تذهبوا به وأخاف أن يأكله الذئب وأنتم عنه غافلون
en: [Jacob] said, "Indeed, it saddens me that you should take him, and I fear that a wolf would eat him while you are of him unaware."

source: قالوا لئن أكله الذئب ونحن عصبة إنا إذا لخاسرون
en: They said, "If a wolf should eat him while we are a [strong] clan, indeed, we would then be losers."

source: فلما ذهبوا به وأجمعوا أن يجعلوه في غيابت الجب وأوحينا إليه لتنبئنهم بأمرهم هذا وهم لا يشعرون
en: So when they took him [out] and agreed to put him into the bottom of the well... But We inspired to him, "You will surely inform them [someday] about this affair of theirs while they do not perceive [your identity]."

source: وجاءوا أباهم عشاء يبكون
en: And they came to their father at night, weeping.

source: قالوا يا أبانا إنا ذهبنا نستبق وتركنا يوسف عند متاعنا فأكله الذئب وما أنت بمؤمن لنا ولو كنا صادقين
en: They said, "O our father, indeed we went racing each other and left Joseph with our possessions, and a wolf ate him. But you would not believe us, even if we were truthful."

source: وجاءوا على قميصه بدم كذب قال بل سولت لكم أنفسكم أمرا فصبر جميل والله المستعان على ما تصفون
en: And they brought upon his shirt false blood. [Jacob] said, "Rather, your souls have enticed you to something, so patience is most fitting. And Allah is the one sought for help against that which you describe."

source: وجاءت سيارة فأرسلوا واردهم فأدلى دلوه قال يا بشرى هذا غلام وأسروه بضاعة والله عليم بما يعملون
en: And there came a company of travelers; then they sent their water drawer, and he let down his bucket. He said, "Good news! Here is a boy." And they concealed him, [taking him] as merchandise; and Allah was knowing of what they did.

source: وشروه بثمن بخس دراهم معدودة وكانوا فيه من الزاهدين
en: And they sold him for a reduced price - a few dirhams - and they were, concerning him, of those content with little.

source: وقال الذي اشتراه من مصر لامرأته أكرمي مثواه عسى أن ينفعنا أو نتخذه ولدا وكذلك مكنا ليوسف في الأرض ولنعلمه من تأويل الأحاديث والله غالب على أمره ولكن أكثر الناس لا يعلمون
en: And the one from Egypt who bought him said to his wife, "Make his residence comfortable. Perhaps he will benefit us, or we will adopt him as a son." And thus, We established Joseph in the land that We might teach him the interpretation of events. And Allah is predominant over His affair, but most of the people do not know.

source: ولما بلغ أشده آتيناه حكما وعلما وكذلك نجزي المحسنين
en: And when Joseph reached maturity, We gave him judgment and knowledge. And thus We reward the doers of good.

source: وراودته التي هو في بيتها عن نفسه وغلقت الأبواب وقالت هيت لك قال معاذ الله إنه ربي أحسن مثواي إنه لا يفلح الظالمون
en: And she, in whose house he was, sought to seduce him. She closed the doors and said, "Come, you." He said, "[I seek] the refuge of Allah. Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed."

source: ولقد همت به وهم بها لولا أن رأى برهان ربه كذلك لنصرف عنه السوء والفحشاء إنه من عبادنا المخلصين
en: And she certainly determined [to seduce] him, and he would have inclined to her had he not seen the proof of his Lord. And thus [it was] that We should avert from him evil and immorality. Indeed, he was of Our chosen servants.

source: واستبقا الباب وقدت قميصه من دبر وألفيا سيدها لدى الباب قالت ما جزاء من أراد بأهلك سوءا إلا أن يسجن أو عذاب أليم
en: And they both raced to the door, and she tore his shirt from the back, and they found her husband at the door. She said, "What is the recompense of one who intended evil for your wife but that he be imprisoned or a painful punishment?"

source: قال هي راودتني عن نفسي وشهد شاهد من أهلها إن كان قميصه قد من قبل فصدقت وهو من الكاذبين
en: [Joseph] said, "It was she who sought to seduce me." And a witness from her family testified. "If his shirt is torn from the front, then she has told the truth, and he is of the liars.

source: وإن كان قميصه قد من دبر فكذبت وهو من الصادقين
en: But if his shirt is torn from the back, then she has lied, and he is of the truthful."

source: فلما رأى قميصه قد من دبر قال إنه من كيدكن إن كيدكن عظيم
en: So when her husband saw his shirt torn from the back, he said, "Indeed, it is of the women's plan. Indeed, your plan is great.

source: يوسف أعرض عن هذا واستغفري لذنبك إنك كنت من الخاطئين
en: Joseph, ignore this. And, [my wife], ask forgiveness for your sin. Indeed, you were of the sinful."

source: وقال نسوة في المدينة امرأت العزيز تراود فتاها عن نفسه قد شغفها حبا إنا لنراها في ضلال مبين
en: And women in the city said, "The wife of al-'Azeez is seeking to seduce her slave boy; he has impassioned her with love. Indeed, we see her [to be] in clear error."

source: فلما سمعت بمكرهن أرسلت إليهن وأعتدت لهن متكأ وآتت كل واحدة منهن سكينا وقالت اخرج عليهن فلما رأينه أكبرنه وقطعن أيديهن وقلن حاش لله ما هذا بشرا إن هذا إلا ملك كريم
en: So when she heard of their scheming, she sent for them and prepared for them a banquet and gave each one of them a knife and said [to Joseph], "Come out before them." And when they saw him, they greatly admired him and cut their hands and said, "Perfect is Allah! This is not a man; this is none but a noble angel."

source: قالت فذلكن الذي لمتنني فيه ولقد راودته عن نفسه فاستعصم ولئن لم يفعل ما آمره ليسجنن وليكونا من الصاغرين
en: She said, "That is the one about whom you blamed me. And I certainly sought to seduce him, but he firmly refused; and if he will not do what I order him, he will surely be imprisoned and will be of those debased."

source: قال رب السجن أحب إلي مما يدعونني إليه وإلا تصرف عني كيدهن أصب إليهن وأكن من الجاهلين
en: He said, "My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant."

source: فاستجاب له ربه فصرف عنه كيدهن إنه هو السميع العليم
en: So his Lord responded to him and averted from him their plan. Indeed, He is the Hearing, the Knowing.

source: ثم بدا لهم من بعد ما رأوا الآيات ليسجننه حتى حين
en: Then it appeared to them after they had seen the signs that al-'Azeez should surely imprison him for a time.

source: ودخل معه السجن فتيان قال أحدهما إني أراني أعصر خمرا وقال الآخر إني أراني أحمل فوق رأسي خبزا تأكل الطير منه نبئنا بتأويله إنا نراك من المحسنين
en: And there entered the prison with him two young men. One of them said, "Indeed, I have seen myself [in a dream] pressing wine." The other said, "Indeed, I have seen myself carrying upon my head [some] bread, from which the birds were eating. Inform us of its interpretation; indeed, we see you to be of those who do good."

source: قال لا يأتيكما طعام ترزقانه إلا نبأتكما بتأويله قبل أن يأتيكما ذلكما مما علمني ربي إني تركت ملة قوم لا يؤمنون بالله وهم بالآخرة هم كافرون
en: He said, "You will not receive food that is provided to you except that I will inform you of its interpretation before it comes to you. That is from what my Lord has taught me. Indeed, I have left the religion of a people who do not believe in Allah, and they, in the Hereafter, are disbelievers.

source: واتبعت ملة آبائي إبراهيم وإسحاق ويعقوب ما كان لنا أن نشرك بالله من شيء ذلك من فضل الله علينا وعلى الناس ولكن أكثر الناس لا يشكرون
en: And I have followed the religion of my fathers, Abraham, Isaac and Jacob. And it was not for us to associate anything with Allah. That is from the favor of Allah upon us and upon the people, but most of the people are not grateful.

source: يا صاحبي السجن أأرباب متفرقون خير أم الله الواحد القهار
en: O [my] two companions of prison, are separate lords better or Allah, the One, the Prevailing?
